Tekla.Structures.Dialog.StructuresInstallation.BinFolder
Path to Tekla Structures binary (bin) directory.

Tekla.Structures.Dialog.StructuresInstallation.InstallFolder
Path to Tekla Structures installation directory.